from components.processor import Processor
from components.assembler import Assembler


def main():
    with open("program.asm", "r", encoding='utf-8') as f:
        program_text = f.readlines()

    assembler = Assembler()

    machine_code = assembler.compile(program_text)

    for code in machine_code:
        print(format(code, '032b'))

    processor = Processor(RAM_size = 2048, SSD_size = 10)
    initial_data = [1, 10, 10, 10, 20, 20, 20]
    processor.load_data(initial_data)
    processor.load_program(machine_code)

    processor.execute_program()


if __name__ == "__main__":
    main()


# /**-------------------------------------------------------------------------------*
# * ИКМО-03-24, Абанин Тимофей                                                      *
# * Гарвардская архитектура, 3-х адрес. Пространство                                *
# * Сумма элементов массива                                                         *
# *                                                                                 *
# * Характеристики устройства:                                                      *
# *                                                                                 *
# * 1. Размер команды – 32 бита                                                     *
# * |--------------|----------------|----------------|----------------|-----------| *
# * |    Команда   |   dest адрес   |   1-oй адрес   |   2-ий адрес   |  Литерал  | *
# * |--------------|----------------|----------------|----------------|-----------| *
# * |     4 бит    |     3 бит      |    3 бит       |     3 бит      |  19 бит   | *
# * |--------------|----------------|----------------|----------------|-----------| *
# *                                                                                 *
# * 2. Кол-во регистров общего назначения - 5.                                      *
# * Размерность регистров - 32 бита.                                                *
# *                                                                                 *
# * 3. Память команд - 2048 ячеек по 32 бита = 65 536 бит = 8 192 байта             *
# * Память данных - 2048 ячеек по 32 бита = 65 536 бит = 8 192 байта                *
# *-------------------------------------------------------------------------------- */